{
  "backend/main.mo": "Motoko actor defining the backend canister with news article management (add/get/filter by category), reader reviews (add/delete/list), and user profile storage, all gated by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report confirming that the AdminPage article form's image file upload input was replaced with a URL text input field labeled 'Image URL'.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's frontend components, pages, hooks, and configuration.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom property tokens for light and dark themes, including colors for background, foreground, card, sidebar, and chart elements.",
  "frontend/index.html": "HTML entry point for the 'AP Insight News' app that mounts the React root div, loads the main TSX module, and includes the Google AdSense async script in the head.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with routes for home, political, movies, article detail, admin, and admin reviews pages, all wrapped in a root layout with Header, Footer, and ActorLoadingGuard.",
  "frontend/src/components/ActorLoadingGuard.tsx": "React component that blocks child rendering until the backend actor is ready, showing a spinner while loading and an error state with a retry button if the actor fails to connect.",
  "frontend/src/components/AdBanner.tsx": "Google AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, initializing the adsbygoogle push on mount with silent error handling for ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants—featured (hero with gradient overlay), newspaper (compact grid), default (standard), and compact (horizontal thumbnail+headline)—each linking to the article detail page.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a compact list item with thumbnail, category badge, title, summary, author, and date, linking to the article detail page.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking news ticker bar showing the latest 10 article titles as links, with a fallback default text when no articles are available.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, description, quick navigation links, category links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header with a breaking news ticker, logo, current date, desktop/mobile navigation links, and admin action buttons.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar with the top 5 articles as numbered links and an ad banner below, used for supplementary navigation on listing pages.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews, as well as purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark themes and news-specific design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for managing news articles, providing a form to add new articles and a list view to delete or purge expired articles, restricted to authenticated users.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews across articles with the ability to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Full article detail page displaying article content, expiry status, related articles, and a reviews section where authenticated users can submit star ratings and text reviews.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero article, secondary stories, and category sections (political, movie news) with skeleton loading states and ad banners.",
  "frontend/src/pages/MovieNewsPage.tsx": "Page listing movie news articles fetched by category, with paginated 'Load More' functionality, skeleton loaders, and a top stories sidebar.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Page listing political news articles fetched by category, with paginated 'Load More' functionality, skeleton loaders, and a top stories sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based design tokens, news-specific palette), fonts (Roboto, Telugu), border radii, shadows, and animation keyframes.",
  "project_state.json": "Project state metadata for 'AP Insight News' tracking schema version, existing features, and a pending feature request to replace image file upload with a URL input field."
}