{
  "backend/main.mo": "Main Motoko actor for the AP Insight News backend, defining types and CRUD operations for news articles, reviews, user profiles, and live status, with role-based access control enforced via AccessControl/MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping three frontend bug-fix features (ActorLoadingGuard timeout, Go Live admin button, useActor error handling) to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-sentence summaries of each frontend source file, describing their purpose and notable changes such as hook replacements, image field renames, and layout updates.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, primary, accent, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the AP Insight News frontend, loading the React app via Vite and including the Google AdSense script tag.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with a root layout (Header, Footer, ActorLoadingGuard wrapping the Outlet) and registers routes for home, political, movies, article detail, admin, and admin reviews pages.",
  "frontend/src/components/ActorLoadingGuard.tsx": "React component that gates child rendering until the backend actor is ready, showing a spinner while loading, and transitioning to an error/retry UI if initialization exceeds a 15-second timeout or the actor is unavailable.",
  "frontend/src/components/AdBanner.tsx": "Reusable Google AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, with a single-push guard and silent error handling for ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Renders a news article card in multiple variants (default, compact, featured, newspaper) with category badges, images, and metadata. Exports named variant components and a default ArticleCard dispatcher.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a horizontal list row with a thumbnail, category badge, title, summary, author, and date.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a scrolling breaking-news ticker bar populated with the latest 10 article titles fetched via useGetAllNews, linking each to its article page.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, quick navigation links, category links, copyright year, and a caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky site header containing the breaking-news ticker, logo, current date, mobile menu toggle, and admin-only Go Live / End Live controls gated behind Internet Identity authentication.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Sidebar component showing the top 5 articles as a numbered list with dates, followed by a rectangular ad banner.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated via Internet Identity) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including fetching, adding, deleting news articles, managing reviews, and purging expired articles.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes and news-specific design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page component for managing news articles, providing a form to add articles with image upload and controls to delete or purge expired articles.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page for viewing and deleting all user reviews, displaying reviewer info, star ratings, and article associations with confirmation dialogs for deletion.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article detail view with metadata, related articles, and a reviews/ratings section. Supports authenticated users via Internet Identity for submitting and deleting reviews, and shows expiry status for articles.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero article, secondary stories, and category sections for political and movie news. Uses skeleton loaders while data is fetching and includes ad banners between sections.",
  "frontend/src/pages/MovieNewsPage.tsx": "Displays a paginated list of movie-category news articles alongside a top-stories sidebar. Supports load-more pagination and shows appropriate loading skeletons and empty/error states.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Displays a paginated list of political-category news articles alongside a top-stories sidebar. Mirrors MovieNewsPage structure with load-more pagination and loading/error/empty states.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting them in sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), fonts (Roboto, Noto Sans Telugu), border radii, box shadows, and keyframe animations, while enabling dark mode and including typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3) as a fix request targeting three existing features: resolving infinite loading in ActorLoadingGuard with a timeout, fixing the admin Go Live/End Live button in Header.tsx, and auditing/fixing the useActor hook initialization flow with proper error handling."
}