{
  "backend/main.mo": "Main Motoko actor defining data types (News, Review, UserProfile, LiveStatus) and CRUD operations for a news platform, with role-based access control for admin/user actions, article expiry, and review management.",
  "feature_evidence.json": "Feature evidence report confirming that descending date-order sorting is implemented across all article listing pages and sidebar components in the frontend.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing their purpose, recent changes, and key implementation details.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom property tokens for light and dark themes including background, foreground, accent, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the AP Insight News app, loading the React app via main.tsx and including a Google AdSense script tag.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with a root layout (Header/Footer + ActorLoadingGuard) and routes for home, political, movies, article detail, admin, and admin reviews pages.",
  "frontend/src/components/ActorLoadingGuard.tsx": "Guard component that blocks child rendering until the backend actor is ready, showing a spinner while loading and an error/retry UI if connection times out or fails.",
  "frontend/src/components/AdBanner.tsx": "Reusable Google AdSense banner component supporting horizontal and rectangle formats, with safe initialization guarded against ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants (featured, newspaper, default, compact) that renders article image, category badge, title, summary, author, and date using imageData from the backend News type.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a compact list item with thumbnail, category badge, title, summary, author, and date, linking to the article detail page.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking news ticker showing the 10 most recent articles sorted by creation date, with links to each article.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, category links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky site header containing the breaking news ticker, logo, current date, navigation links, mobile menu toggle, and admin-only controls for live status toggling.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Sidebar component that displays the top 5 most recent articles sorted by date with numbered rankings, plus an ad banner below the list.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states to the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews, as well as purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark themes and news-specific design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing news articles, allowing authenticated users to add articles with image uploads, delete articles, and purge expired content.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page for viewing and deleting all user-submitted reviews, displaying reviewer info, star ratings, and associated article IDs.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Full article detail page that displays article content, related articles, and a reviews section where authenticated users can submit star ratings and written reviews.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays a hero article, secondary stories, and category sections (political, movie news) with skeleton loading states, all sorted by date descending.",
  "frontend/src/pages/MovieNewsPage.tsx": "Paginated movie news listing page with a sidebar, skeleton loaders, and a 'Load More' button, displaying articles sorted by date descending.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Paginated political news listing page with a sidebar, skeleton loaders, and a 'Load More' button, displaying articles sorted by date descending.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based), fonts (Roboto, Telugu), border radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file recording existing features, pending feature requests, and metadata for the AP Insight News platform, focused on sorting articles by descending date."
}