{
  "backend/main.mo": "Main Motoko actor defining News, Review, and UserProfile types with CRUD operations, access-control enforcement (admin/user roles), and 7-day article expiry logic.",
  "feature_evidence.json": "Feature evidence report linking the admin article submission fix to specific frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing their purpose, styling approach, and key implementation details.",
  "frontend/index.css": "Tailwind base CSS defining OKLCH color tokens for light and dark themes, including background, foreground, card, border, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point titled 'AP Insight News' that mounts the React app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router with a root layout (Header/Footer) and routes for home, political, movies, article detail, admin, and admin reviews pages.",
  "frontend/src/components/ArticleCard.tsx": "Renders news articles in four visual variants (featured, newspaper, default, compact) with category badges, placeholder images, and formatted metadata.",
  "frontend/src/components/ArticleListItem.tsx": "Horizontal list-row article component with a 120×80px thumbnail, category badge, headline, summary snippet, author, and date for use in listing pages.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Auto-scrolling breaking news ticker that displays the 10 most recent article headlines as clickable links with a dark-red 'Breaking' badge.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, quick links, category links, copyright notice, and a caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header with a breaking news ticker, logo, date display, navigation links, and a mobile menu toggle.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar listing the top 5 news articles with numbered rank, title, and publication date, each linking to the article page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching, adding, and deleting news articles and reviews.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines CSS custom properties for the news-themed design system (colors, typography), and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Entry point that bootstraps the React app with React Query, Internet Identity, and the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for managing news articles, providing a form to add articles and controls to delete or purge expired ones, requiring authentication.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews with metadata and provides per-review delete functionality via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Detail page for a single news article showing full content, expiry status, related articles, and an authenticated review submission form with star ratings.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a hero article, secondary stories, and categorized sections for political and movie news with loading skeletons.",
  "frontend/src/pages/MovieNewsPage.tsx": "Paginated list page for movie-category news articles with a sidebar of top stories and a load-more button.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "React page component that fetches and displays political news articles using a paginated list with a sidebar, loading skeletons, and error/empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using oklch variables), fonts, border radii, shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the app's current version, existing features, and a pending fix request (AR-1) for a broken article submission flow on the Admin page."
}