{
  "backend/main.mo": "Main Motoko actor defining News, Review, and UserProfile types with CRUD operations for news articles (admin-only), reviews (user-only), and user profiles, including role-based access control and article expiration logic.",
  "feature_evidence.json": "Feature evidence report confirming that the Google AdSense script tag has been added to frontend/index.html with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and recent changes across components, pages, hooks, and config files.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, accent, chart, and sidebar color tokens.",
  "frontend/index.html": "Single HTML entry point for the React SPA titled 'AP Insight News', including the Google AdSense script tag in the head and a root div for the React app.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with routes for home, political, movies, article detail, admin, and admin reviews pages, all wrapped in a root layout with Header, Footer, and ActorLoadingGuard.",
  "frontend/src/components/ActorLoadingGuard.tsx": "Guard component that blocks child rendering until the backend actor is ready, showing a spinner while loading and an error state with a retry button if the actor fails to connect.",
  "frontend/src/components/AdBanner.tsx": "AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, initializing adsbygoogle on mount with silent error handling for ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants (featured, newspaper, default, compact) that renders article images from `article.imageData` with category badges, author, and date metadata.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a compact list item with thumbnail, category badge, title, summary, author, and date, linking to the article detail page.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking news ticker bar showing the latest 10 article titles as links, falling back to a default tagline if no news is loaded.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, description, quick navigation links, category links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header with a breaking news ticker, logo, current date, desktop/mobile navigation links, and admin action buttons.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar with the top 5 articles as numbered links and a rectangle ad banner below the list.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews, as well as purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark themes and news-specific design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing news articles, providing a form to add articles with image upload and controls to delete or purge expired articles.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews across articles with the ability to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Full article detail page displaying article content, expiry status, related articles, and a reviews section where authenticated users can submit star ratings and text reviews.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero article, secondary stories, and category sections (political, movie news) with skeleton loading states and ad banners.",
  "frontend/src/pages/MovieNewsPage.tsx": "Page displaying paginated movie news articles in a list layout with a top stories sidebar, skeleton loading, and a 'Load More' button.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Page displaying paginated political news articles in a list layout with a top stories sidebar, skeleton loading, and a 'Load More' button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based design tokens, news-specific palette), fonts (Roboto, Telugu), shadows, border radii, and plugins (typography, container queries, animate).",
  "project_state.json": "Project state metadata for 'AP Insight News' tracking schema version, existing features, and a pending feature request to add a Google AdSense script tag to the HTML head."
}