{
  "backend/main.mo": "Main Motoko actor defining the news platform backend with types for News, Review, UserProfile, and LiveStatus, plus CRUD operations for articles, reviews, user profiles, live status, and HTTP outcall-based auto-fetch from news sources, all gated by role-based access control.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor (News without sourceUrl) to NewActor by adding a sourceUrl field to all news items and initializing empty processedUrls and newsSources collections.",
  "feature_evidence.json": "Feature evidence report mapping two features — multi-source admin fetch UI in AdminPage.tsx and corresponding React Query hooks in useQueries.ts — to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing their purpose, key changes, and relationships to backend types and hooks.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, primary, accent, destructive, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the AP Insight News app, loading the React app via main.tsx and including the Google AdSense script.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with routes for home, political, movies, article detail, admin, and admin reviews pages, all wrapped in a root layout with Header, Footer, and ActorLoadingGuard.",
  "frontend/src/components/ActorLoadingGuard.tsx": "React component that blocks child rendering until the backend actor is ready, showing a spinner while loading and an error/retry screen if the connection times out or fails after 15 seconds.",
  "frontend/src/components/AdBanner.tsx": "AdSense banner component that renders a horizontal or rectangle ad slot using the adsbygoogle API, with silent error handling for ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Renders a news article card in multiple variants (default, compact, featured, newspaper) with category badges, images, and metadata like author and date.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a horizontal list item with a thumbnail, category badge, title, summary, and author/date metadata.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a scrolling breaking news ticker bar showing the 10 most recent article titles as links, fetched via the useGetAllNews hook.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, quick navigation links, category links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky site header with a breaking news ticker, logo, date display, mobile navigation menu, and admin-only Go Live/End Live controls gated by Internet Identity authentication.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Sidebar component that displays the top 5 most recent articles as a numbered list, followed by an ad banner.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, adding, deleting, and managing news articles and reviews via the backend actor, including mutations for auto-fetching and purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS with custom CSS variables for light/dark themes, and defines reusable news-specific component utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing news articles, supporting manual article creation with image upload, deletion, purging expired articles, and fetching news from specific Telugu news sources.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page for viewing and deleting all user-submitted article reviews, displaying reviewer name, star rating, article ID, and review text with confirmation dialogs for deletion.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article detail view with metadata, related articles, and a reviews/ratings section. Supports authenticated users (via Internet Identity) adding or deleting reviews, and shows an expiry warning for time-limited articles.",
  "frontend/src/pages/HomePage.tsx": "Renders the main home page with a hero article, secondary stories, and category sections (political, movies) fetched via React Query hooks. Includes skeleton loading states and ad banners.",
  "frontend/src/pages/MovieNewsPage.tsx": "Displays a paginated list of movie-category news articles sorted by date, with a top-stories sidebar and skeleton loading/error states. Supports loading more articles in increments via a 'Load More' button.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Displays a paginated list of political-category news articles sorted by date, with a top-stories sidebar and skeleton loading/error states. Mirrors the structure of MovieNewsPage for the political category.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom OKLCH-based color tokens (including news-specific colors), custom font families (Roboto, Telugu), border radii, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current state of the 'AP Insight News' project (version 3), listing existing features around admin dashboard multi-source fetch UI and React Query hooks, plus pending feature requests to automate article ingestion from eenadu.net, sakshi.com, and andhrajyothy.com via RSS feeds with deduplication."
}