{
  "backend/main.mo": "Motoko actor defining the news platform backend with types for News, Review, and UserProfile, plus CRUD operations for articles (admin-only), reviews (user-only), and user profiles, with role-based access control and 7-day article expiry.",
  "feature_evidence.json": "Feature evidence report mapping the 'Unable to connect to backend' fix to ActorLoadingGuard.tsx and listing related components and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key changes for build planning reference.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based design tokens for light and dark themes, including colors for background, foreground, primary, destructive, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the 'AP Insight News' app that loads the React app and includes a Google AdSense script tag in the head.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with a root layout wrapping Header, Footer, and ActorLoadingGuard around all page routes including home, political, movies, article detail, admin, and admin reviews.",
  "frontend/src/components/ActorLoadingGuard.tsx": "React component that gates child rendering behind backend actor availability, showing a spinner while connecting and an error state with a retry button if the actor fails to load.",
  "frontend/src/components/AdBanner.tsx": "Google AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, with a one-time push to adsbygoogle and silent error handling for ad blockers.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants—featured (hero with gradient overlay), newspaper (compact grid), default (standard), and compact (horizontal thumbnail)—each linking to the article detail page.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a compact list item with thumbnail, category badge, title, summary, author, and date, linking to the article detail page.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking news ticker bar showing the latest 10 article titles as links, fetched via useGetAllNews.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, category links, copyright info, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky site header containing the breaking news ticker, logo, current date, desktop/mobile navigation links, and admin action buttons.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Sidebar component displaying the top 5 articles as a numbered list with titles and dates, followed by an ad banner.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews, as well as purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark themes and news-specific design tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for managing news articles, providing a form to add new articles and a list view with delete and purge-expired functionality, gated behind Internet Identity authentication.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews across articles with the ability to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Article detail page that displays full article content, expiry status, related articles, and a reviews section where authenticated users can submit star ratings and text reviews.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a hero article, secondary stories, and category sections (political, movie news) with skeleton loading states and ad banners.",
  "frontend/src/pages/MovieNewsPage.tsx": "Page displaying paginated movie news articles in a list layout with a top stories sidebar, skeleton loaders, and a 'Load More' button.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Page displaying paginated political news articles in a list layout with a top stories sidebar, skeleton loaders, and a 'Load More' button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based design tokens, news-specific palette), fonts (Roboto, Telugu), border radii, shadows, and plugin integrations (typography, container-queries, animate).",
  "project_state.json": "Project state metadata tracking version, known issues (backend connection failure in production), and existing fix-request features for wiring canister ID environment variables."
}