{
  "backend/main.mo": "Main Motoko actor defining the news platform backend with types for News, Review, and UserProfile, plus CRUD operations for articles (admin-only), reviews, and user profiles, with role-based access control and 7-day article expiry.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and recent changes for build planning reference.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom property tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the AP Insight News app, loading the React app via main.tsx and including the Google AdSense script.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with a root layout (Header, Footer, ActorLoadingGuard) and routes for home, political, movies, article detail, admin, and admin reviews pages.",
  "frontend/src/components/ActorLoadingGuard.tsx": "Guard component that blocks child rendering until the backend actor is ready, showing a spinner while loading and an error state with retry button if the actor fails to connect.",
  "frontend/src/components/AdBanner.tsx": "Google AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, with safe push logic to avoid duplicate ad initialization.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants (featured, newspaper, default, compact) that render article image, category badge, title, summary, author, and date using `article.imageData` for images.",
  "frontend/src/components/ArticleListItem.tsx": "Horizontal list item component displaying a thumbnail, category badge, title, summary, author, and date for use in article listing pages, sourcing images from `article.imageData`.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Renders a scrolling breaking news ticker bar that displays the 10 most recent article titles as clickable links, falling back to a default tagline when no news is available.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, quick navigation links, category links, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header with a breaking news ticker, logo, current date, desktop/mobile navigation links, and admin action buttons.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar listing the top 5 articles with numbered rankings and publication dates, followed by a rectangle ad banner.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, identity persistence via AuthClient, and status tracking exposed through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching, adding, deleting, and purging news articles by various criteria, as well as fetching and managing movie reviews, all via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Roboto, Noto Sans Telugu), sets up Tailwind directives, and defines CSS custom properties for light/dark themes including news-specific color tokens and typography utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider (React Query), InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for managing news articles, providing a form to add articles (with image upload, category selection, and expiry), and a list view to delete or purge expired articles, gated behind Internet Identity authentication.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user-submitted reviews with reviewer info, star ratings, and article references, allowing admins to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Article detail page that displays full article content, expiry status, related articles, and a reviews section where authenticated users can submit star ratings and text reviews.",
  "frontend/src/pages/HomePage.tsx": "Home page that displays a hero article, secondary stories, and categorized sections for political and movie news using ArticleCard components, with skeleton loading states.",
  "frontend/src/pages/MovieNewsPage.tsx": "Displays a paginated list of movie-category news articles with a sidebar of top stories, loading skeletons, and error/empty states.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Displays a paginated list of political-category news articles with a sidebar of top stories, loading skeletons, and error/empty states; mirrors MovieNewsPage structure.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (oklch-based design tokens, news-specific palette), font families, border radii, shadows, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project fix request state, noting that articles are not sorted newest-first and listing two pending action items: fix backend sort order and ensure frontend pages preserve that order without client-side reversal."
}