{
  "backend/main.mo": "Main Motoko actor defining the news platform backend with CRUD operations for news articles (with 24-hour expiry), reviews, and user profiles, all gated by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report mapping the 'Rename MANAGE REVIEWS to Movie Reviews' feature to its implementation file (Header.tsx) with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell titled 'AP Insight News' that mounts the React app at the #root div and loads the main.tsx entry point.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with a root layout (Header/Footer) and routes for home, political, movies, article detail, admin, and admin/reviews pages.",
  "frontend/src/components/ArticleCard.tsx": "Reusable article card component supporting four display variants (featured, newspaper, default, compact) with category badges, images, and metadata.",
  "frontend/src/components/ArticleListItem.tsx": "Horizontal list-row article component with a 120×80px thumbnail on the left and headline, summary, author, and date metadata on the right, used in listing pages.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Auto-scrolling breaking news ticker that fetches the 10 most recent articles and displays clickable headlines separated by diamond separators, with a dark-red 'Breaking' badge.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, quick links, category links, copyright notice, and a caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header with a breaking news ticker, logo, date display, navigation links, and a mobile menu toggle.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar listing the top 5 news articles with numbered rank, title, and publication date as links.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews.",
  "frontend/src/index.css": "Defines global CSS including Google Fonts imports, Tailwind directives, CSS custom properties for the news-themed design system, and reusable component utility classes.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin page for adding, viewing, and deleting news articles, with form state management and expiry display logic.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews with the ability to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Detail page for a single news article showing full content, related articles, and an authenticated review submission form with star ratings.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a hero article, secondary stories, and sectioned grids for political and movie news with loading skeletons.",
  "frontend/src/pages/MovieNewsPage.tsx": "Paginated list page for movie-category news articles with a top-stories sidebar and load-more functionality.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "React page component that fetches and displays political news articles by category, with pagination (load more), loading skeletons, error/empty states, and a top stories sidebar.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using oklch variables), font families, border radii, box shadows, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata describing an app with movie article/review management, tracking a pending feature request to rename the 'MANAGE REVIEWS' navigation label to 'Movie Reviews'."
}