{
  "backend/main.mo": "Motoko actor defining a News canister with CRUD operations — addNews, getNewsById, getAllNews, and getNewsByCategory — storing articles in an in-memory Map keyed by ID.",
  "feature_evidence.json": "Empty feature evidence report with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "Minimal HTML shell titled 'AP Insight News' that mounts the React app into a root div and loads the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Defines TanStack Router configuration with a root layout (Header/Footer) and five routes: home, /political, /movies, /article/$id, and /admin.",
  "frontend/src/components/ArticleCard.tsx": "Renders news articles in four visual variants — featured (hero with gradient overlay), newspaper (compact grid), default (standard), and compact (horizontal) — with category badges, image fallbacks, and formatted dates.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single article as a horizontal list row with a 120×80px thumbnail, category badge, headline, summary snippet, author, and date; used in listing pages.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking-news ticker showing the 10 most recent article titles as clickable links, with a dark-red 'Breaking' badge on the left.",
  "frontend/src/components/Footer.tsx": "Site footer with a four-column grid containing the logo/brand blurb, quick links, category links, a bottom copyright bar, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Renders the site header with a breaking news ticker, logo, current date, admin link, and category navigation tabs with mobile menu support.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Displays a sidebar with the top 5 news articles as numbered links, showing title and publication date.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all news, news by category, and news by ID, plus a mutation hook for adding a new article via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, defines CSS custom properties for the news site's design tokens (colors, typography), and declares reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin form page for creating and submitting new news articles, supporting image upload, text file import for content, field validation, and success/error feedback.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article's full content fetched by ID, requiring Internet Identity authentication; shows a login prompt for unauthenticated users and a related articles sidebar.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero article, secondary stories, and paginated sections for political and movie news using skeleton loaders while data fetches.",
  "frontend/src/pages/MovieNewsPage.tsx": "Displays a paginated list of movie-category articles with a top-stories sidebar, skeleton loading states, and a load-more button.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Displays a paginated list of political-category articles with a top-stories sidebar, skeleton loading states, and a load-more button.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, news-specific colors, condensed/Telugu font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state (version 11) for 'AP Insight News', a GreatAndhra-inspired news website with political and movie news categories, listing existing features, architectural notes, and requirements."
}