{
  "backend/main.mo": "Motoko actor defining the backend for a news platform with CRUD operations for news articles, reviews, and user profiles, including role-based access control via AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report mapping two actor-readiness features (ActorLoadingGuard and useQueries null-guard) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their purpose and key implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the AP Insight News app that mounts the React root div, loads the main TSX module, and includes a Google AdSense script tag.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all app routes (home, political, movies, article detail, admin, admin reviews) wrapped in a RootLayout that uses ActorLoadingGuard to block rendering until the backend actor is ready.",
  "frontend/src/components/ActorLoadingGuard.tsx": "React component that gates child rendering on backend actor availability, showing a spinner while fetching and an error/retry screen if the actor is unavailable.",
  "frontend/src/components/AdBanner.tsx": "Reusable Google AdSense banner component supporting horizontal (728×90) and rectangle (300×250) formats, with a one-time push to adsbygoogle and silent error handling.",
  "frontend/src/components/ArticleCard.tsx": "Article card component with four display variants (featured, newspaper, default, compact) for rendering news articles with images, category badges, and metadata.",
  "frontend/src/components/ArticleListItem.tsx": "Renders a single news article as a compact list item with thumbnail, category badge, title, summary, author, and date, linking to the article detail page.",
  "frontend/src/components/BreakingNewsTicker.tsx": "Displays a horizontally scrolling breaking news ticker bar showing the latest 10 article titles as links, with a fallback default text when no articles are loaded.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, description, quick navigation links, category links, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Renders the sticky site header including the breaking news ticker, logo, current date, desktop/mobile navigation links, and admin action buttons.",
  "frontend/src/components/TopStoriesSidebar.tsx": "Renders a sidebar showing the top 5 articles as a numbered list with titles and dates, followed by an ad banner below.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access control if a token is present, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and exposing login status states to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including fetching, adding, and deleting news articles and reviews, as well as purging expired articles.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines CSS custom properties for light/dark themes along with news-specific utility component classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing news articles, providing a form to add new articles and a list view with delete and purge-expired actions, restricted to authenticated users.",
  "frontend/src/pages/AdminReviewsPage.tsx": "Admin page that lists all user reviews across articles with the ability to delete individual reviews via a confirmation dialog.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Full article detail page displaying article content, expiry status, related articles, and a reviews section where authenticated users can submit star ratings and text reviews.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays a hero article, secondary stories, and category sections (political, movie news) with skeleton loading states and ad banners.",
  "frontend/src/pages/MovieNewsPage.tsx": "Paginated movie news listing page with a sidebar of top stories, skeleton loaders, and a 'Load More' button for incremental article display.",
  "frontend/src/pages/PoliticalNewsPage.tsx": "Paginated political news listing page mirroring MovieNewsPage structure, fetching articles by the political category with sidebar and load-more support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors, news-specific color tokens, condensed/Telugu font families, and animation plugins.",
  "project_state.json": "Project state metadata tracking existing features and known issues, specifically focused on fixing the 'Backend connection not ready' initialization error in the actor/query hooks."
}