{
  "kind": "build_request",
  "title": "Sort articles in descending order by date (latest first)",
  "projectName": "AP Insight News",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the backend, update the query that returns all news articles so that results are sorted by date in descending order (newest articles first).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Please arrange the articles in dicending order in date.example latest date articles showing firts."
        ]
      },
      "acceptanceCriteria": [
        "The backend function returning all articles returns them sorted by date descending.",
        "The most recently dated article appears at index 0 of the returned array."
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the frontend, ensure all article listing pages (HomePage, PoliticalNewsPage, MovieNewsPage) and sidebar components (TopStoriesSidebar, BreakingNewsTicker) display articles in descending date order (latest first). If client-side sorting is needed to complement the backend change, apply a sort by date descending before rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Please arrange the articles in dicending order in date.example latest date articles showing firts."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the hero and secondary story articles reflect the latest articles first.",
        "On the Political News and Movie News pages, articles are listed from newest to oldest.",
        "The Top Stories sidebar and Breaking News ticker display the most recent articles first.",
        "No article with an older date appears before an article with a newer date in any list view."
      ]
    }
  ],
  "constraints": [
    "Do not change the article data model or schema.",
    "Do not modify files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding user-facing sort controls or filters.",
    "Changing pagination behavior beyond sort order.",
    "Modifying article detail page layout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}