{
  "kind": "build_request",
  "title": "Fix article sorting — latest first",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the backend returns all news articles sorted in descending order by `createdAt` (newest first). Audit the query/filter function in `backend/main.mo` that returns article lists and confirm the sort is applied correctly before returning results.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "articles still not sorted by latest first?"
        ]
      },
      "acceptanceCriteria": [
        "The backend function that returns article lists sorts results by `createdAt` in descending order.",
        "A newly added article appears first in the returned list.",
        "Older articles appear after newer ones consistently."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure that all frontend pages that display article lists (HomePage, PoliticalNewsPage, MovieNewsPage, TopStoriesSidebar, BreakingNewsTicker) render articles in the exact order returned by the backend without any client-side re-sorting or reversal that could override the newest-first order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "articles still not sorted by latest first?"
        ]
      },
      "acceptanceCriteria": [
        "HomePage hero and section lists show the most recently created article first.",
        "PoliticalNewsPage and MovieNewsPage lists show newest articles at the top.",
        "TopStoriesSidebar shows the 5 most recent articles in descending date order.",
        "BreakingNewsTicker ticker shows the latest 10 articles newest first.",
        "No client-side sort or reverse is applied that contradicts backend order."
      ]
    }
  ],
  "constraints": [
    "Do not change the article data schema or existing fields.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new article fields or changing the data model.",
    "Pagination logic changes beyond what is needed to fix sort order.",
    "Any UI redesign or visual changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}